SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_i2c.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 I2C register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_I2C_H
#define EFR32SG23_I2C_H

#define I2C_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_I2C I2C
 * @{
 * @brief EFR32SG23 I2C Register Declaration.
 *****************************************************************************/

/** I2C Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP VERSION Register                                */
  __IOM uint32_t             EN;                     /**< Enable Register                                    */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IM  uint32_t             STATE;                  /**< State Register                                     */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             CLKDIV;                 /**< Clock Division Register                            */
  __IOM uint32_t             SADDR;                  /**< Follower Address Register                          */
  __IOM uint32_t             SADDRMASK;              /**< Follower Address Mask Register                     */
  __IM  uint32_t             RXDATA;                 /**< Receive Buffer Data Register                       */
  __IM  uint32_t             RXDOUBLE;               /**< Receive Buffer Double Data Register                */
  __IM  uint32_t             RXDATAP;                /**< Receive Buffer Data Peek Register                  */
  __IM  uint32_t             RXDOUBLEP;              /**< Receive Buffer Double Data Peek Register           */
  __IOM uint32_t             TXDATA;                 /**< Transmit Buffer Data Register                      */
  __IOM uint32_t             TXDOUBLE;               /**< Transmit Buffer Double Data Register               */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
        uint32_t             RESERVED0[1007U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP VERSION Register                                */
  __IOM uint32_t             EN_SET;                 /**< Enable Register                                    */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IM  uint32_t             STATE_SET;              /**< State Register                                     */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             CLKDIV_SET;             /**< Clock Division Register                            */
  __IOM uint32_t             SADDR_SET;              /**< Follower Address Register                          */
  __IOM uint32_t             SADDRMASK_SET;          /**< Follower Address Mask Register                     */
  __IM  uint32_t             RXDATA_SET;             /**< Receive Buffer Data Register                       */
  __IM  uint32_t             RXDOUBLE_SET;           /**< Receive Buffer Double Data Register                */
  __IM  uint32_t             RXDATAP_SET;            /**< Receive Buffer Data Peek Register                  */
  __IM  uint32_t             RXDOUBLEP_SET;          /**< Receive Buffer Double Data Peek Register           */
  __IOM uint32_t             TXDATA_SET;             /**< Transmit Buffer Data Register                      */
  __IOM uint32_t             TXDOUBLE_SET;           /**< Transmit Buffer Double Data Register               */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED1[1007U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP VERSION Register                                */
  __IOM uint32_t             EN_CLR;                 /**< Enable Register                                    */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IM  uint32_t             STATE_CLR;              /**< State Register                                     */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             CLKDIV_CLR;             /**< Clock Division Register                            */
  __IOM uint32_t             SADDR_CLR;              /**< Follower Address Register                          */
  __IOM uint32_t             SADDRMASK_CLR;          /**< Follower Address Mask Register                     */
  __IM  uint32_t             RXDATA_CLR;             /**< Receive Buffer Data Register                       */
  __IM  uint32_t             RXDOUBLE_CLR;           /**< Receive Buffer Double Data Register                */
  __IM  uint32_t             RXDATAP_CLR;            /**< Receive Buffer Data Peek Register                  */
  __IM  uint32_t             RXDOUBLEP_CLR;          /**< Receive Buffer Double Data Peek Register           */
  __IOM uint32_t             TXDATA_CLR;             /**< Transmit Buffer Data Register                      */
  __IOM uint32_t             TXDOUBLE_CLR;           /**< Transmit Buffer Double Data Register               */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED2[1007U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP VERSION Register                                */
  __IOM uint32_t             EN_TGL;                 /**< Enable Register                                    */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IM  uint32_t             STATE_TGL;              /**< State Register                                     */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             CLKDIV_TGL;             /**< Clock Division Register                            */
  __IOM uint32_t             SADDR_TGL;              /**< Follower Address Register                          */
  __IOM uint32_t             SADDRMASK_TGL;          /**< Follower Address Mask Register                     */
  __IM  uint32_t             RXDATA_TGL;             /**< Receive Buffer Data Register                       */
  __IM  uint32_t             RXDOUBLE_TGL;           /**< Receive Buffer Double Data Register                */
  __IM  uint32_t             RXDATAP_TGL;            /**< Receive Buffer Data Peek Register                  */
  __IM  uint32_t             RXDOUBLEP_TGL;          /**< Receive Buffer Double Data Peek Register           */
  __IOM uint32_t             TXDATA_TGL;             /**< Transmit Buffer Data Register                      */
  __IOM uint32_t             TXDOUBLE_TGL;           /**< Transmit Buffer Double Data Register               */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
} I2C_TypeDef;
